{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "PeftModel",
    "parent_library": "peft.peft_model"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_proj",
    "q_proj"
  ],
  "task_type": null
}