{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Blip2ForConditionalGeneration",
    "parent_library": "transformers.models.blip_2.modeling_blip_2"
  },
  "base_model_name_or_path": "ybelkada/blip2-opt-2.7b-fp16-sharded",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q_proj",
    "k_proj"
  ],
  "task_type": null
}